#+TITLE: Notes / Lab Book
#+AUTHOR: Isak Falk
#+EMAIL: ucabitf@ucl.ac.uk
#+DATE: \today
#+DESCRIPTION: Lab book of thoughts and notes (this is free form and also functions as a kind of diary)
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:15 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:nil pri:nil tags:not-in-toc
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [bigger]
#+LATEX_HEADER: \usepackage{macros}
#+LATEX_HEADER: \usepackage{mathtools}

**** KRR Least Squares solution (with meta-algorithm from bias)
:LOGBOOK:
CLOCK: [2019-11-11 Mon 15:10]--[2019-11-11 Mon 15:35] =>  0:25
CLOCK: [2019-11-11 Mon 14:36]--[2019-11-11 Mon 15:01] =>  0:25
CLOCK: [2019-11-11 Mon 13:59]--[2019-11-11 Mon 14:24] =>  0:25
:END:
Following cite:denevi18_learn we may generalise the KRR to
the meta-learning setting by generalising the RERM problem to
#+BEGIN_EXPORT latex
\begin{equation*}
\metalg_{\lambda, h_{0}}(D^{tr}) = \argmin_{h \in
  \Hc}\frac{1}{n_{tr}}\sum_{i=1}^{n_{tr}}(h(x_{i}) - y_i)^{2} +
\lambda \norm{h - h_{0}}^{2}_{\Hc}
\end{equation*}
#+END_EXPORT
with the corresponding solution of (at least when the RKHS is
finite-dimensional and we are doing normal LSQ)
#+BEGIN_EXPORT latex
\begin{equation*}
\metalg(D^{tr})(x) = \scal{\sum_{i=1}^{n_{tr}}\alpha_{i}\phi(x_{i})}{\phi(x)}_{\Hc} = \scal{\vb{w}_{\lambda, h_{0}}(D^{tr})}{\phi(x)}_{\Hc}
\end{equation*}
#+END_EXPORT
where
#+BEGIN_EXPORT latex
\begin{equation*}
\vb{w}_{\lambda, h_{0}}(D^{tr}) = (\phi(\vb{X})^{T}\phi(\vb{X}) + n \lambda I)^{-1}(\phi(\vb{X})^{T}\vb{Y} + n \lambda h_{0}) =
\end{equation*}
#+END_EXPORT

The analysis done in [[KRR Least Squares solution]] still holds, although
we can't express the function in its dual form anymore, as long as we
are in finite-dimensional Euclidean space it does does not complicate
things much. In this case we can also see, that if the change of the
hyperparameters \((\lambda, h_{0}\) changes smoothly as a function of
\(D^{tr}\) we still have that the space induced by
\(L(\metalg_{\lambda, h_{0}}, \task)\) is smooth.

***** KRR Least Squares solution (with meta-algorithm from bias)
:LOGBOOK:
CLOCK: [2019-11-11 Mon 15:10]--[2019-11-11 Mon 15:35] =>  0:25
CLOCK: [2019-11-11 Mon 14:36]--[2019-11-11 Mon 15:01] =>  0:25
CLOCK: [2019-11-11 Mon 13:59]--[2019-11-11 Mon 14:24] =>  0:25
:END:
Following cite:denevi18_learn we may generalise the KRR to
the meta-learning setting by generalising the RERM problem to
#+BEGIN_EXPORT latex
\begin{equation*}
\metalg_{\lambda, h_{0}}(D^{tr}) = \argmin_{h \in
  \Hc}\frac{1}{n_{tr}}\sum_{i=1}^{n_{tr}}(h(x_{i}) - y_i)^{2} +
\lambda \norm{h - h_{0}}^{2}_{\Hc}
\end{equation*}
#+END_EXPORT
with the corresponding solution of (at least when the RKHS is
finite-dimensional and we are doing normal LSQ)
#+BEGIN_EXPORT latex
\begin{equation*}
\metalg(D^{tr})(x) = \scal{\sum_{i=1}^{n_{tr}}\alpha_{i}\phi(x_{i})}{\phi(x)}_{\Hc} = \scal{\vb{w}_{\lambda, h_{0}}(D^{tr})}{\phi(x)}_{\Hc}
\end{equation*}
#+END_EXPORT
where
#+BEGIN_EXPORT latex
\begin{equation*}
\vb{w}_{\lambda, h_{0}}(D^{tr}) = (\phi(\vb{X})^{T}\phi(\vb{X}) + n \lambda I)^{-1}(\phi(\vb{X})^{T}\vb{Y} + n \lambda h_{0})
\end{equation*}
#+END_EXPORT

The analysis done in [[KRR Least Squares solution]] still holds, although
we can't express the function in its dual form anymore, as long as we
are in finite-dimensional Euclidean space it does does not complicate
things much. In this case we can also see, that if the change of the
hyperparameters \((\lambda, h_{0}\) changes smoothly as a function of
\(D^{tr}\) we still have that the space induced by
\(L(\metalg_{\lambda, h_{0}}, \task)\) is smooth.

